app/controllers/countries_controller.rb

SELECT * FROM "countries"
---
  def index
    @countries = Country.all

SELECT * FROM "countries" WHERE ("countries"."id" = 2)
---
  def show
    if params[:id]=="with_ports"
      with_ports
      return
    end
    @country = Country.find(params[:id])

INSERT INTO "countries" ("text", "code", "created_at", "updated_at") VALUES(NULL, NULL, '2010-03-07 11:47:41', '2010-03-07 11:47:41')
---
  def create
    @country = Country.new(params[:country])

    respond_to do |format|
      if @country.save