app/controllers/currencies_controller.rb

  def index
   @currencys =Currency.all
---
SELECT * FROM "currencies"

  def create
    data= params[:data]
    json_obj= ActiveSupport::JSON.decode(data)
    @currency = Currency.new(json_obj)

    if @currency.save
---
INSERT INTO "currencies" ("curr", "created_at", "updated_at") VALUES('EUR', '2010-04-10 08:36:18', '2010-04-10 08:36:18')