app/controllers/ice_classes_controller.rb

  def index
    @ice_classs =IceClass.all
---
SELECT * FROM "ice_classes"

  def create
    data= params[:data]
    json_obj= ActiveSupport::JSON.decode(data)
    @ice_class = IceClass.new(json_obj)

    if @ice_class.save
---
INSERT INTO "ice_classes" ("code", "created_at", "updated_at") VALUES('1A Super', '2010-03-27 16:44:51', '2010-03-27 16:44:51')