app/controllers/ports_controller.rb

  def tarifs
    id= Integer(params[:port_id])
    logger.info "Id= %s" %id
    if(id< 1)
      tarifs=Array.new
    else
      if (Port.exists? id)
         @port = Port.find(id)
---
SELECT "ports".id FROM "ports" WHERE ("ports"."id" = 182) LIMIT 1

  def index
    @ports = Port.all
---
SELECT * FROM "ports"

  def show
    @port = Port.find(params[:id])
---
SELECT * FROM "ports" WHERE ("ports"."id" = 0)

  def update
    @port = Port.find(params[:id])

    if @port.update_attributes(ActiveSupport::JSON.decode(params[:data]))
---
SELECT * FROM "ports" WHERE ("ports"."id" = 2)
UPDATE "ports" SET "description" = '<b>zzzzzzzzzzzzz</b>', "updated_at" = '2010-03-11 06:54:36' WHERE "id" = 2

  def destroy
    @port = Port.find(params[:id])
    if @port.destroy
---
SELECT * FROM "ports" WHERE ("ports"."id" = 1)
DELETE FROM "ports" WHERE "id" = 1