app/controllers/posts_controller.rb

SELECT * FROM "posts"
---
  def index
   @posts =Post.all

INSERT INTO "posts" ("name", "val", "val1", "name2", "created_at", "updated_at") VALUES('eeee', NULL, NULL, '', '2010-03-24 05:46:33', '2010-03-24 05:46:33')
---
  def create
    data= params[:data]
    json_obj= ActiveSupport::JSON.decode(data)
    @post = Post.new(json_obj)

    if @post.save

SELECT * FROM "posts" WHERE ("posts"."id" = 1)
UPDATE "posts" SET "name2" = '3', "updated_at" = '2010-03-24 05:47:10' WHERE "id" = 1
---
  def update
    @posts = Post.find(params[:id])

    if @posts.update_attributes(ActiveSupport::JSON.decode(params[:data]))