app/controllers/prof_tarif_calcs_controller.rb

  def index
    if params[:proforma_id]
      prof_id= params[:proforma_id]
    else
      prof_id = -1
    end

    @prof_tarif_calcs =ProfTarifCalc.find_all_by_proforma_id prof_id
---
SELECT * FROM "prof_tarif_calcs" WHERE ("prof_tarif_calcs"."proforma_id" IS NULL)

  def gen_tarifs
    data= params[:data]
    json_obj= ActiveSupport::JSON.decode(data)
    prof =Proforma.new json_obj
    logger.debug "calculating for port %s" % json_obj["port_id"]
    port= Port.find(json_obj["port_id"])
    profCalc=Array.new
    if port
      tarifs= port.tarifs
    else
      tarifs= []
    end
    tarifs.each{|t|
---
SELECT * FROM "ports" WHERE ("ports"."id" = 156)
SELECT * FROM "tarifs" WHERE ("tarifs".tarif_calculation_id = 8)