app/controllers/proformas_controller.rb

  def index
    @proformas =Proforma.all
---
SELECT * FROM "proformas"

  def create
    data= params[:data]
    json_obj= ActiveSupport::JSON.decode(data)
    @proforma = Proforma.new(json_obj)
    @proforma.prof_tarif_calcs= convertTarifCalcs
    if @proforma.save
---
INSERT INTO "proformas" ("status", "curr", "date_curr", "vessel_id", "port_id", "arrived", "sailed", "estimated_arrive", "gw", "calls", "registration_date", "created_at", "updated_at") VALUES(NULL, '', NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, '2010-04-10 09:18:40', '2010-04-10 09:18:40')

  def update
    @proforma = Proforma.find(params[:id])
    logger.info @proforma.prof_tarif_calcs.nil?
    ProfTarifCalc.delete_all(:proforma_id=>@proforma.id)
    @proforma.prof_tarif_calcs << convertTarifCalcs
    if @proforma.update_attributes(ActiveSupport::JSON.decode(params[:data]))
---
SELECT * FROM "proformas" WHERE ("proformas"."id" = 2)
DELETE FROM "prof_tarif_calcs" WHERE ("prof_tarif_calcs"."proforma_id" = 2)
INSERT INTO "prof_tarif_calcs" ("tarif_id", "proforma_id", "val", "created_at", "updated_at", "description", "remark") VALUES(13, 2, 2619.79, '2010-05-09 10:40:04', '2010-05-09 10:40:04', NULL, NULL)
UPDATE "proformas" SET "arrived" = '2010-04-10 00:00:00', "sailed" = '2010-04-10 00:00:00', "updated_at" = '2010-04-10 13:47:20' WHERE "id" = 2