app/controllers/tarif_calculations_controller.rb

  def index
    port_id=params[:port_id]
    if(port_id)
      @tarif_calculations =TarifCalculation.find_all_by_port_id(port_id)
---
SELECT * FROM "tarif_calculations" WHERE ("tarif_calculations"."port_id" = '-1')