app/controllers/tarif_calculations_controller.rb

  def index
    @tarif_calculations = TarifCalculation.all
---
SELECT * FROM "tarif_calculations"

  def show
    @tarif_calculation = TarifCalculation.find(params[:id])
---
SELECT * FROM "tarif_calculations" WHERE ("tarif_calculations"."id" = 1)

  def create
    data= params[:data]
    jsonObj= ActiveSupport::JSON.decode(data)
    @tarif_calculation = TarifCalculation.new(jsonObj)
     if @tarif_calculation.save
---
INSERT INTO "tarif_calculations" ("from", "to", "active", "notes", "created_at", "updated_at", "port_id") VALUES('2010-01-01', '2010-12-31', NULL, '2010', '2010-04-03 13:09:51', '2010-04-03 13:09:51', NULL)

  def update
    @tarif_calculation = TarifCalculation.find(params[:id])
---
SELECT * FROM "tarif_calculations" WHERE ("tarif_calculations"."id" = 1)

  def destroy
    @tarif_calculation = TarifCalculation.find(params[:id])
    @tarif_calculation.destroy
---
SELECT * FROM "tarif_calculations" WHERE ("tarif_calculations"."id" = 2)
DELETE FROM "tarif_calculations" WHERE "id" = 2