app/controllers/tarifs_controller.rb

  def index
    @tarifs = Tarif.all
---
SELECT * FROM "tarifs"

  def show
    @tarif = Tarif.find(params[:id])
---
SELECT * FROM "tarifs" WHERE ("tarifs"."id" = 0)

  def create
    @tarif = Tarif.new(params[:tarif])

    respond_to do |format|
      if @tarif.save
---
INSERT INTO "tarifs" ("tarif_calculation_id", "name", "formula", "is_manual", "created_at", "updated_at") VALUES(1, 'ttt', 'ddd', NULL, '2010-04-02 10:21:11', '2010-04-02 10:21:11')

  def update
    @tarif = Tarif.find(params[:id])

    respond_to do |format|
      if @tarif.update_attributes(params[:tarif])
---
SELECT * FROM "tarifs" WHERE ("tarifs"."id" = 3)
UPDATE "tarifs" SET "is_manual" = 'f', "updated_at" = '2010-04-04 14:27:19' WHERE "id" = 3

  def destroy
    @tarif = Tarif.find(params[:id])
    @tarif.destroy
---
SELECT * FROM "tarifs" WHERE ("tarifs"."id" = 1)
DELETE FROM "tarifs" WHERE "id" = 1