app/controllers/testing_controller.rb

SELECT * FROM "proformas" WHERE ("proformas"."id" = 2)
SELECT * FROM "prof_tarif_calcs" WHERE ("prof_tarif_calcs".proforma_id = 2)
SELECT * FROM "tarifs" WHERE ("tarifs"."id" = 14)
---
  def evalt
    proforma = Proforma.find(2)
    formulas=""
    proforma.prof_tarif_calcs.each{ |pct|