app/controllers/vessel_types_controller.rb

  def index
    @vessel_types = VesselType.all
---
SELECT * FROM "vessel_types"