app/controllers/vessels_controller.rb

  def index
   @vessels =Vessel.all
---
SELECT * FROM "vessels"

  def create
    data= params[:data]
    json_obj= ActiveSupport::JSON.decode(data)
    @vessel = Vessel.new(json_obj)

    if @vessel.save
---
INSERT INTO "vessels" ("name", "flag", "vesel_type", "owner_id", "loa", "vessel_length", "beam", "dw", "draft", "gross_tonnage", "net_tonnage", "cap1", "paxcap", "ice_class", "calls", "contact_info", "max_draft", "safety_cert_date", "construction_cert_date", "equipment_date", "security_cert_date", "int_load_line_cert_date", "oil_pollut_prevent_date", "tonnage_cert_issued_date", "sanitation_contr_exempt_date", "created_at", "updated_at") VALUES('gggg', NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, '', '', NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, '2010-03-27 10:01:11', '2010-03-27 10:01:11')

  def update
    @vessels = Vessel.find(params[:id])

    if @vessels.update_attributes(ActiveSupport::JSON.decode(params[:data]))
---
SELECT * FROM "vessels" WHERE ("vessels"."id" = 2)
UPDATE "vessels" SET "flag" = 58, "loa" = NULL, "vessel_length" = NULL, "updated_at" = '2010-03-27 14:17:26' WHERE "id" = 7

  def destroy
    @vessels = Vessel.find(params[:id])
     if @vessels.destroy
---
SELECT * FROM "vessels" WHERE ("vessels"."id" = 1)
DELETE FROM "vessels" WHERE "id" = 1